InformationRegisters/ПроцентыТайногоПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПроцентыТайногоПокупателя</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МП_ЗадачаМагазина</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипАнкет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТабельРаботыПродавцов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ТабельРаботыПродавцов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отсутствие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтсутствия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвойствоПродавца</Name>
					<Comment>0 - Полный, 1 - Частичный, 2 - Старший продавец, 3 - Практикант, 4 - Стажер, 5 - Ночной почасовик, 6 - Старший ночной почасовик</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Comment>Время работы почасовика (в часах), используется для магазинов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тренинг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тренинги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭкстренныйВызов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаСотрудника</Name>
					<Comment>ЦФО к которому привязан сотрудник через Помощника ТУ/ТУ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПроцентыТайногоПокупателя/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Отказ = Ложь;
	ПроверитьЗаполнениеДанных(Отказ);
	Если Отказ = Истина Тогда
		Возврат
	КонецЕсли;
	
	ЗаписатьИЗакрытьНаСервере();
	ВладелецФормы.Элементы.Список.Обновить();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИЗакрытьНаСервере()
	СоздатьНаборЗаписейНаСервере();	
КонецПроцедуры
	
&НаКлиенте
Процедура Записать(Команда)
	Отказ = Ложь;
	ПроверитьЗаполнениеДанных(Отказ);
	Если Отказ = Истина Тогда
		Возврат
	КонецЕсли;
	ЗаписатьНаСервере();
	ВладелецФормы.Элементы.Список.Обновить()
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	СоздатьНаборЗаписейНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПродавцов(Команда)
	ПроставитьПродавцовНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ПроставитьПродавцовНаСервере()
	
	Если ЗначениеЗаполнено(СтруктурнаяЕдиница) И ЗначениеЗаполнено(ДатаПроверки) Тогда
		
		Продавцы.Очистить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛистУчетаПродавцы.Продавец
		|ИЗ
		|	Документ.ЛистУчета.Продавцы КАК ЛистУчетаПродавцы
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ЛистУчетаПродавцы.Ссылка.Дата, ДЕНЬ) = &Дата
		|	И ЛистУчетаПродавцы.Ссылка.ТорговаяТочка = &ТорговаяТочка";
		
		Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаПроверки));
		Запрос.УстановитьПараметр("ТорговаяТочка", СтруктурнаяЕдиница);
		
		ТЗ_Результат = Запрос.Выполнить().Выгрузить();
		
		Если ТЗ_Результат.Количество() = 0 Тогда
			ЗапросПоТабелю = Новый Запрос;
			ЗапросПоТабелю.Текст = 
				"ВЫБРАТЬ
				|	ТабельРаботыПродавцов.Сотрудник КАК Продавец
				|ИЗ
				|	РегистрСведений.ТабельРаботыПродавцов КАК ТабельРаботыПродавцов
				|ГДЕ
				|	ТабельРаботыПродавцов.ТорговаяТочка = &ТорговаяТочка
				|	И НАЧАЛОПЕРИОДА(ТабельРаботыПродавцов.Период, ДЕНЬ) = &Дата";
		
			ЗапросПоТабелю.УстановитьПараметр("Дата", НачалоДня(ДатаПроверки));
			ЗапросПоТабелю.УстановитьПараметр("ТорговаяТочка", СтруктурнаяЕдиница);

	        ТЗ_Результат = ЗапросПоТабелю.Выполнить().Выгрузить();
		КонецЕсли; 
		
		Для Каждого Строка Из ТЗ_Результат Цикл
			НовСтрока = Продавцы.Добавить();		
			НовСтрока.Продавец = Строка.Продавец;
		КонецЦикла;
 		
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Период = ТекущаяДата();
КонецПроцедуры

&НаСервере
Процедура СоздатьНаборЗаписейНаСервере()
	
	Для Каждого Строка Из Продавцы Цикл	
		
		НЗ = РегистрыСведений.ПроцентыТайногоПокупателя.СоздатьНаборЗаписей();
		НЗ.Отбор.Продавец.Установить(Строка.Продавец);
		НЗ.Отбор.СтруктурнаяЕдиница.Установить(СтруктурнаяЕдиница);
        НЗ.Отбор.ДатаПроверки.Установить(ДатаПроверки);
        НЗ.Отбор.ТипАнкет.Установить(ТипАнкет);
        НЗ.Отбор.Период.Установить(Период);
		НЗ.Прочитать();
		НЗ.Очистить();
		
		НоваяЗапись = НЗ.Добавить();
		НоваяЗапись.Продавец = Строка.Продавец;
		НоваяЗапись.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
		НоваяЗапись.ДатаПроверки = ДатаПроверки;
		НоваяЗапись.ТипАнкет = ТипАнкет;
		НоваяЗапись.Период = Период;
		НоваяЗапись.Процент = Процент;
		НоваяЗапись.ИмяФайла = ИмяФайла;
		НоваяЗапись.Комментарий = Комментарий;
		НоваяЗапись.Ответственный = Ответственный;
		//Беляк +
		НоваяЗапись.Задача = Задача;
		//Беляк -
		//НЗ.Записывать = Истина;
		НЗ.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОкно(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеДанных(Отказ = Ложь)
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Сообщить("Значение Период не заполнено!", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	Если Продавцы.Количество() = 0 Тогда
		Сообщить("Значение Продавец не заполнено!", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		Сообщить("Значение Структурная Единица не заполнено!", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаПроверки) Тогда
		Сообщить("Значение Дата Проверки не заполнено!", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТипАнкет) Тогда
		Сообщить("Значение Тип Анкет не заполнено!", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Процент) Тогда
		Сообщить("Значение Процент не заполнено!", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;  	
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогФайла.МножественныйВыбор = Ложь;
	//ДиалогФайла.Фильтр = "(*.jpg;*.jpeg;*.gif;*.tif;*.png)|*.jpg;*.jpeg;*.gif;*.tif;*.png";
	ДиалогФайла.ПроверятьСуществованиеФайла = Истина;
	Если ДиалогФайла.Выбрать() Тогда
		ИмяФайла = ДиалогФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры
